var express = require('express');
var router = express.Router();
var template = require('../lib/template.js');
var author = require('../lib/author.js');

router.get('/', function (request, response) {
    var title = 'For me 나를 위해';
    var authStatusUI = '<a class="nav-link" href="/login">로그인</a>';
    var head = ``;
    var body = `
    <main class="flex-shrink-0">
    <div class="container">
        <div class="row">
            <center>
            <br><br>
                <img src='images/main1.png'  width="600px" alt="메인 사진" ><br><br>
                <a href="/store/merit"><button type="button" class="btn btn-secondary">종류별 장단점</button></a>
            </center>
        </div>
        <br> <br>
    </div>

    <div style="background-color: rgb(248,238,254);">
         <center>
            <br><br>
            <a href="https://find-your-type.netlify.app/">
            <img src='images/main2.png'  width="500px" alt="메인2 사진">
            </a>
            <br>

        </center>
        <br><br>
    </div>

    <div class="container">
        <center>
            <div>
            <div id="map" style="width:750px; height:400px;"></div>
            <script src="https://dapi.kakao.com/v2/maps/sdk.js?appkey=1c9766dae5fddfe9cdd8a20819475f20"></script>
            <script>
            var mapContainer = document.getElementById('map'), 
                    mapOption = {
                        center: new kakao.maps.LatLng(37.56682, 126.97865), 
                        level: 6,
                        mapTypeId : kakao.maps.MapTypeId.ROADMAP 
                    };
            var map = new kakao.maps.Map(mapContainer, mapOption); 
            
            var 데이터 = [
            [37.5664776017, 127.1730292516, '서울특별시 강동구 아리수로93길 47', '<div style="padding:5px"> 강동청소년센터_시립</div>'],
            [37.6459890891, 127.0064057877, '서울특별시 강북구 4.19로 74', '<div style="padding:5px"> 강북청소년센터_시립</div>'],
            [37.4702439018, 126.9352433199, '서울특별시 관악구 신림로23길 17', '<div style="padding:5px">관악청소년센터</div>'],
            [37.5463104566, 127.1062555516, '서울특별시 광진구 구천면로 2', '<div style="padding:5px">광진청소년센터_시립</div>'],
            [37.4913197035, 126.8833990055, '서울특별시 구로구 구로동로 141', '<div style="padding:5px">구로청소년센터_시립</div>'],
            [37.4482220959, 126.9156908434, '서울특별시 금천구 금하로 30길 54', '<div style="padding:5px">금천청소년센터_시립</div>'],
            [37.6414780876, 127.0582171589, '서울특별시 노원구 덕릉로 70길 99', '<div style="padding:5px">노원청소년센터_시립</div>'],
            [37.58724711, 127.0500266861, '서울특별시 동대문구 제기로33길 25', '<div style="padding:5px">동대문청소년센터_시립</div>'],
            [37.4923333378, 127.1566463086, '서울특별시 송파구 성내천로319', '<div style="padding:5px">마천청소년센터_구립</div>'],
            [37.566312837, 126.9016156689, '서울특별시 마포구 월드컵로212', '<div style="padding:5px">마포청소년센터_시립</div>'],
            [37.6062211437, 127.1088391268, '서울특별시 중랑구 송림길 156', '<div style="padding:5px">망우청소년센터_시립</div>'],
            [37.5307193896, 126.8754986247, '서울특별시 양천구 목동서로143', '<div style="padding:5px">목동청소년센터_시립</div>'],
            [37.518852251, 126.8941147183, '서울특별시 영등포구 문래로 110', '<div style="padding:5px">문래청소년센터_시립</div>'],
            [37.4953810628, 126.9189142015, '서울특별시 동작구 여의대방로20길 33, 보라매청소년수련관 큰나무동 1층 업무지원팀', '<div style="padding:5px">보라매청소년센터_시립</div>'],
            [37.4568520028, 126.9291462282, '서울특별시 관악구 호암로 454-16', '<div style="padding:5px">삼성산청소년센터_사립</div>'],
            [37.5789743647, 126.9383447056, '서울특별시 서대문구 연희로32길 129', '<div style="padding:5px">서대문청소년센터_시립</div>'],
            [37.5674695165, 126.9905565425, '서울특별시 중구 을지로11길 23', '<div style="padding:5px">서울청소년센터_시립</div>'],
            [37.5623630065, 127.0364529988, '서울특별시 성동구 고산자로 260', '<div style="padding:5px">성동청소년센터_시립</div>'],
            [37.48970358, 127.1112620661, '서울특별시 송파구 중대로 4길 4, 청소년수련시설 송파청소년수련관', '<div style="padding:5px">송파청소년센터_구립</div>'],
            [37.4835908846, 127.0887928969, '서울특별시 강남구 광평로 144', '<div style="padding:5px">수서청소년센터_시립</div>'],
            [37.5942157413, 126.9245442093, '서울특별시 은평구 백련산로 4길 16', '<div style="padding:5px">은평청소년센터_시립</div>'],
            [37.5096316769, 127.08010171, '서울특별시 송파구 올림픽로 8길 22', '<div style="padding:5px">잠실청소년센터_구립</div>'],
            [37.551855488, 127.0125672983, '서울특별시 중구 동호로5길19 ', '<div style="padding:5px">중구청소년센터_구립</div>'],
            [37.5732265834, 127.0859727577, '서울특별시 중랑구 용마산로 217', '<div style="padding:5px">중랑청소년센터_시립</div>'],
            [37.6581173975, 127.0507053294, '서울특별시 도봉구 노해로 69길 132, 4층 ', '<div style="padding:5px">창동청소년센터_시립</div>'],
            [37.534685313, 126.8608014616, '서울특별시 강서구 곰달래로 57가길 26', '<div style="padding:5px">화곡청소년센터_시립</div>'],
            [37.4934150228, 126.8327262494, '서울특별시 구로구 부일로 949', '<div style="padding:5px">구로청소년문화의집</div>'],
            [37.5376079827, 126.9502169466, '서울특별시 마포구 도화2길 77', '<div style="padding:5px">도화청소년문화의집</div>'],
            [37.5040504099, 126.9332459275, '서울특별시 동작구 상도로 15바길 5 ', '<div style="padding:5px">동작청소년문화의집</div>'],
            [37.580322292, 126.8838463266, '서울특별시 마포구 상암산로1길 67,', '<div style="padding:5px">마포청소년문화의집</div>'],
            [37.4853871026, 126.9757291372, '서울특별시 동작구 사당로 23길 57-7', '<div style="padding:5px">사당청소년문화의집</div>'],
            [37.6711377345, 127.0566604656, '서울특별시 노원구 동일로230길 6', '<div style="padding:5px">상계청소년문화의집</div>'],
            [37.5492412669, 127.0185298086, '서울특별시 성동구 장터1길 18,', '<div style="padding:5px">성동청소년문화의집</div>'],
            [37.6156520333, 127.0085058273, '서울특별시 성북구 솔샘로 107', '<div style="padding:5px">성북청소년문화의집</div>'],
            [37.6542176014, 127.0290800657, '서울특별시 도봉구 시루봉로2길 34,', '<div style="padding:5px">쌍문동청소년문화의집</div>'],
            [37.5136577596, 126.9170778827, '서울특별시 영등포구 영등포로64길 15 ', '<div style="padding:5px">영등포청소년문화의집</div>'],
            [37.5389037956, 126.9650121544, '서울특별시 용산구 백범로 329', '<div style="padding:5px">용산꿈나무종합타운_용산청소년문화의집</div>'],
            [37.6043727788, 126.9166274698, '서울특별시 은평구 연서로6길7', '<div style="padding:5px">은평구청소년문화의집 신나는애프터센터</div>'],
            [37.6016333077, 126.9499143082, '서울특별시 서대문구 포방터길 110', '<div style="padding:5px">홍은청소년문화의집</div>'],
            [37.5564791214, 126.8442859603, '서울특별시 강서구 공항대로 42길 23-19, 3층', '<div style="padding:5px">강서구청소년상담복지센터</div>'],
            [37.5402634327, 127.0651093418, '서울특별시 광진구 아차산로 24길 17, 3층', '<div style="padding:5px">광진구청소년상담복지센터</div>'],
            [37.6667920624, 127.0777978606, '서울특별시 노원구 덕릉로115길8, 성원빌딩 5층', '<div style="padding:5px">노원구청소년상담복지센터</div>'],
            [37.584723137, 126.9137295065, '서울특별시 서대문구 증가로30길 45-9, 휴먼센터 3~4층', '<div style="padding:5px">서대문구청소년상담복지센터</div>'],
            [37.6047401646, 127.0105825721, '서울특별시 성북구 정릉로 242, 4층', '<div style="padding:5px">성북구청소년상담복지센터</div>'],
            [37.4953810628, 126.9189142015, '서울특별시 동작구 여의대방로20길 33, 자유회관 1층', '<div style="padding:5px">동작청소년성문화센터</div>'],
            [37.48970358, 127.1112620661, '서울특별시 송파구 중대로 4길 4, 1층 성문화센터', '<div style="padding:5px">송파청소년성문화센터</div>'],
            [37.5251674152, 126.9032995566, '서울특별시 영등포구 영신로 200', '<div style="padding:5px">아하청소년성문화센터</div>'],
            [37.6094070491, 126.9349538787, '서울특별시 은평구 통일로 684', '<div style="padding:5px">은평청소년성문화센터</div>'],
            [37.5748917275, 127.0834390437, '서울특별시 중랑구 면목로 23길 20', '<div style="padding:5px">중랑청소년성문화센터</div>'],
            [37.5706561909, 126.9723943492, '서울특별시 종로구 새문안로3길 3, 지하2층', '<div style="padding:5px">탁틴내일청소년성문화센터</div>'],
            [37.5004137213, 127.1415240357, '서울특별시 송파구 동남로 28길 40', '<div style="padding:5px">송파청소년미래센터</div>'],
            [37.6416909731, 127.0734280532, '서울특별시 노원구 노원로 16길 16', '<div style="padding:5px">시립노원청소년미래진로센터</div>'],
            [37.6094070491, 126.9349538787, '서울특별시 은평구 통일로 684, 공유동', '<div style="padding:5px">시립은평청소년미래진로센터</div>'],
            [37.5251674152, 126.9032995566, '서울특별시 영등포구 영신로 200', '<div style="padding:5px">시립청소년미래진로센터_하자</div>'],
            [37.5078304582, 126.9472628395, '서울특별시 동작구 만양로3길 8', '<div style="padding:5px">노량진1동청소년독서실</div>'],
            [37.4862572872, 126.9716425456, '서울특별시 동작구 사당로 13길 50', '<div style="padding:5px">사당3동청소년독서실</div>'],
            [37.4804686478, 126.9731012876, '서울특별시 동작구 사당로 22나길 71', '<div style="padding:5px">사당4동청소년독서실 </div>'],
            [37.4969992463, 126.9300084721, '서울특별시 동작구 국사봉 2나길 25', '<div style="padding:5px">상도3동청소년독서실</div>'],
            [37.5085050946, 126.9619383115, '서울특별시 동작구 서달로 13길 17', '<div style="padding:5px">흑석동청소년독서실</div>'],
            [37.5531513987, 126.8322620322, '서울특별시 강서구 강서로 47길 72', '<div style="padding:5px">강서구시설관리공단_발산동청소년공부방</div>'],
            [37.5680402294, 126.8101655535, '서울특별시 강서구 초원로11길 19', '<div style="padding:5px">강서구시설관리공단_방화동청소년공부방</div>'],
            [37.5518937887, 126.8674025734, '서울특별시 강서구 공항대로 59다길 80', '<div style="padding:5px">강서구시설관리공단_염창동청소년공부방</div>'],
            [37.6061347123, 127.0770722428, '서울특별시 중랑구 중랑역로 142, B1', '<div style="padding:5px">1318상상발전소</div>'],
            [37.5521737983, 127.1357082409, '서울특별시 강동구 암사길 57, 3층', '<div style="padding:5px">강동청소년누리터</div>'],
            [37.5497573716, 127.1462327002, '서울특별시 강동구 양재대로 138길 41', '<div style="padding:5px">강동청소년회관</div>'],
            [37.6413012911, 127.0315024438, '서울특별시 강북구 도봉로 98길 33, 상가 3층', '<div style="padding:5px">강북늘푸른교육센터</div>'],
            [37.5473371806, 126.8733192347, '서울특별시 강서구 공항대로 615', '<div style="padding:5px">강서구청교육청소년과</div>'],
            [37.5564791214, 126.8442859603, '서울특별시 강서구 공항대로42길 23-19', '<div style="padding:5px">강서청소년회관</div>'],
            [37.488067572, 126.9215601807, '서울특별시 관악구 관천로113', '<div style="padding:5px">관악늘푸른교육센터</div>'],
            [37.6019948648, 126.9185327327, '서울특별시 은평구 진흥로1길17', '<div style="padding:5px">꿈꾸는다락방</div>'],
            [37.5030294784, 126.9363431287, '서울특별시 동작구 상도로 152-1, 2층 카페나무', '<div style="padding:5px">서울시립십대여성일시지원센터_나무</div>'],
            [37.5130313197, 127.0666552952, '서울특별시 강남구 봉은사로 114길 43, 신관 4, 5층', '<div style="padding:5px">서울시립청소년드림센터</div>'],
            [37.5590887844, 126.9902662779, '서울특별시 중구 퇴계로26가길 6', '<div style="padding:5px">서울시립청소년문화교류센터</div>'],
            [37.540999829, 126.9726644039, '서울특별시 용산구 한강대로 255', '<div style="padding:5px">서울시립청소년미디어센터</div>'],
            [37.5590887844, 126.9902662779, '서울특별시 중구 퇴계로 26가길 6', '<div style="padding:5px">서울유스호스텔</div>'],
            [37.5897551897, 127.0857628247, '서울특별시 중랑구 겸재로35길 38', '<div style="padding:5px">서울청소년자율문화공간</div>'],
            [37.4953810628, 126.9189142015, '서울특별시 동작구 여의대방로20길 33', '<div style="padding:5px">서울특별시립청소년활동진흥센터</div>'],
            [37.4782860375, 126.9990556357, '서울특별시 서초구 방배로 5길 11', '<div style="padding:5px">서초구립방배유스센터</div>'],
            [37.6471990205, 127.0260518873, '서울특별시 도봉구 노해로 140', '<div style="padding:5px">쌍문동청소년랜드</div>'],
            [37.6052808379, 126.9119697797, '서울특별시 은평구 역말로 14,  3층  청소년문화공간주역촌동', '<div style="padding:5px">주_청소년문화공간</div>'],
            [37.5251674152, 126.9032995566, '서울특별시 영등포구 영신로 200, 하이서울유스호스텔 1층 사무실', '<div style="padding:5px">하이서울유스호스텔</div>'],
            [37.5856765479, 126.9410962895, '서울특별시 서대문구 통일로 39길114, 2층', '<div style="padding:5px">홍제동청소년활동공간_꿈다락</div>'],
            [37.5497573716, 127.1462327002, '서울특별시 강동구 양재대로138길 41, 2층', '<div style="padding:5px">강동구건강가정다문화가족지원센터</div>'],
            [37.5290599728, 126.8488981783, '서울특별시 강서구 강서로5길 50, 곰달래문화복지센터 4층', '<div style="padding:5px">강서구건강가정다문화가족지원센터</div>'],
            [37.4675976516, 126.9448709116, '서울특별시 관악구 신림로3길 35, 남파김삼준문화복지기념과 3,4층', '<div style="padding:5px">관악구건강가정다문화가족지원센터</div>'],
            [37.5402634327, 127.0651093418, '서울특별시 광진구 아차산로 24길 17, 5층(자양동, 자양공공힐링센터)', '<div style="padding:5px">광진구건강가정다문화가족지원센터</div>'],
            [37.4825340986, 126.889718083, '서울특별시 구로구 우마2길 35, 구로구가족통합지원센터 2층', '<div style="padding:5px">구로구건강가정다문화가족지원센터</div>'],
            [37.4555039138, 126.9042313381, '서울특별시 금천구 금하로 11길 40', '<div style="padding:5px">금천구건강가정다문화가족지원센터</div>'],
            [37.6224729853, 127.0726391041, '서울특별시 노원구 동일로173가길 94, 3층', '<div style="padding:5px">노원구건강가정다문화가족지원센터</div>'],
            [37.604271152, 126.9296385607, '서울특별시 은평구 은평로21가길 15-17 ', '<div style="padding:5px">은평구건강가정다문화가족지원센터</div>'],
            [37.5736880055, 127.0132067027, '서울특별시 종로구 종로53길 29, 토월2층', '<div style="padding:5px">종로구건강가정다문화가족지원센터</div>'],
            [37.5650915889, 127.0227850732, '서울특별시 중구 퇴계로460, 10층', '<div style="padding:5px">중구건강가정다문화가족지원센터</div>'],
            [37.6264729309, 127.0786598, '서울특별시 노원구 공릉로187, 5층(건설빌딩)', '<div style="padding:5px">노원여성인력개발센터</div>'],
            [37.5772849087, 127.0301470908, '서울특별시 동대문구 왕산로 60-1', '<div style="padding:5px">동대문여성인력개발센터</div>'],
            [37.5575632795, 126.9431790319, '서울특별시 서대문구 신촌역로10, 4층', '<div style="padding:5px">서대문여성인력개발센터</div>'],
            [37.4963405358, 127.1187984465, '서울특별시 송파구 중대로9길 34', '<div style="padding:5px">송파여성인력개발센터</div>'],
            [37.5348287029, 126.966398353, '서울특별시 용산구 청파로 139-21', '<div style="padding:5px">용산여성인력개발센터</div>'],
            [37.5929959527, 127.0764763481, '서울특별시 중랑구 망우로32길 20', '<div style="padding:5px">중랑여성인력개발센터</div>'],
            [37.4632181622, 126.9056423392, '서울특별시 금천구 독산로 50길 23', '<div style="padding:5px">남부여성발전센터</div>'],
            [37.5394028008, 127.0667179129, '서울특별시 광진구 아차산로30길 36', '<div style="padding:5px">동부여성발전센터</div>'],
            [37.6428268392, 127.0612846056, '서울특별시 노원구 동일로207길 50', '<div style="padding:5px">북부여성발전센터</div>'],
            [37.5342632134, 126.8299211389, '서울특별시 양천구 남부순환로 371', '<div style="padding:5px">서부여성발전센터</div>'],
            [37.5407840016, 126.94396889, '서울특별시 마포구 토정로35길 17', '<div style="padding:5px">중부여성발전센터</div>'],
            [37.5116087174, 126.9272264226, '서울특별시 동작구 여의대방로54길 18', '<div style="padding:5px">서울시여성가족재단</div>'],
            [37.6201739154, 127.0769361956, '서울특별시 노원구 동일로 174길 27', '<div style="padding:5px">서울여성공예센터_더아리움</div>'],
            [37.5600926354, 126.8383041066, '서울특별시 강서구 강서로 385, 511호', '<div style="padding:5px">장애여성네트워크</div>'],
            [37.4955657765, 127.1068969426, '서울특별시 송파구 양재대로 897', '<div style="padding:5px">가락종합사회복지관</div>'],
            [37.564627383, 126.8535195605, '서울특별시 강서구 양천로57길 36', '<div style="padding:5px">가양5종합사회복지관</div>'],
            [37.5457741648, 126.9748245582, '서울특별시 용산구 두텁바위로 25', '<div style="padding:5px">갈월종합사회복지관</div>'],
            [37.6295896681, 127.0698547843, '서울특별시 노원구 동일로 1127', '<div style="padding:5px">공릉종합사회복지관</div>'],
            [37.4768918173, 126.8917817099, '서울특별시 금천구 가산로 129', '<div style="padding:5px">금천누리종합사회복지관</div>'],
            [37.4637899587, 126.896717054, '서울특별시 금천구 시흥대로 101길 7', '<div style="padding:5px">금천장애인종합복지관</div>'],
            [37.6088146559, 127.0247800128, '서울특별시 성북구 삼양로8가길 32', '<div style="padding:5px">길음종합사회복지관</div>'],
            [37.474985871, 126.9843744158, '서울특별시 서초구 남부순환로 2124', '<div style="padding:5px">까리따스방배종합사회복지관</div>'],
            [37.6292472102, 127.0596641245, '서울특별시 노원구 월계로 372', '<div style="padding:5px">노원1종합사회복지관</div>'],
            [37.6027114456, 126.931782963, '서울특별시 은평구 은평로21길 14-26', '<div style="padding:5px">녹번종합사회복지관</div>'],
            [37.5099263075, 126.930425296, '서울특별시 동작구 여의대방로44길 47', '<div style="padding:5px">대방종합사회복지관</div>'],
            [37.4931206821, 126.9768758593, '서울특별시 동작구 동작대로 35차길7 ', '<div style="padding:5px">동작이수사회복지관</div>'],
            [37.5707203119, 126.8057256447, '서울특별시 강서구 개화동로 21길 4', '<div style="padding:5px">방화11종합사회복지관</div>'],
            [37.5105335037, 126.9568902877, '서울특별시 동작구 노량진로 32길 79', '<div style="padding:5px">본동종합사회복지관</div>'],
            [37.486685107, 126.9575760807, '서울특별시 관악구  관악로 254', '<div style="padding:5px">봉천종합사회복지관</div>'],
            [37.4832722008, 126.9714537257, '서울특별시 동작구 사당로 14길 20', '<div style="padding:5px">사당종합사회복지관</div>'],
            [37.4992313168, 127.0950096768, '서울특별시 송파구 백제고분로 32길 35', '<div style="padding:5px">삼전종합사회복지관</div>'],
            [37.5594709598, 126.9570364048, '서울특별시 서대문구 북아현로 24', '<div style="padding:5px">서대문장애인종합복지관</div>'],
            [37.5714545264, 126.9200822915, '서울특별시 서대문구 모래내로 177', '<div style="padding:5px">서대문종합사회복지관</div>'],
            [37.6424441981, 127.056581106, '서울특별시 노원구 덕릉로 70가길 96', '<div style="padding:5px">서울시립뇌성마비복지관</div>'],
            [37.609297527, 127.0949042016, '서울특별시 중랑구 신내로 115', '<div style="padding:5px">서울시립대학교종합사회복지관</div>'],
            [37.6425376234, 127.0569697009, '서울특별시 노원구 덕릉로70가길 92', '<div style="padding:5px">서울시립북부장애인종합복지관</div>'],
            [37.4953810628, 126.9189142015, '서울특별시 동작구 여의대방로 20길 33', '<div style="padding:5px">시립발달장애인복지관</div>'],
            [37.6058186173, 127.0916097676, '서울특별시 중랑구 봉화산로 153', '<div style="padding:5px">신내종합사회복지관</div>'],
            [37.5543613581, 127.0095230604, '서울특별시 중구 동호로11길22', '<div style="padding:5px">신당종합사회복지관</div>'],
            [37.464837595, 126.9198595175, '서울특별시 관악구 난곡로 110', '<div style="padding:5px">신림종합사회복지관</div>'],
            [37.5234950595, 126.8778179283, '서울특별시 양천구 목동동로 12길59', '<div style="padding:5px">신목종합사회복지관</div>'],
            [37.5200327613, 126.8473668696, '서울특별시 양천구 신월로 24길 19', '<div style="padding:5px">신월종합사회복지관</div>'],
            [37.4973173815, 126.9076949268, '서울특별시 영등포구 신길로 13길 4', '<div style="padding:5px">영등포종합사회복지관</div>'],
            [37.4698617998, 127.0238660049, '서울특별시 서초구 바우뫼로7길 11', '<div style="padding:5px">우면종합사회복지관</div>'],
            [37.6044704692, 127.0959157113, '서울특별시 중랑구 신내로56', '<div style="padding:5px">원광장애인종합복지관</div>'],
            [37.5650915889, 127.0227850732, '서울특별시 중구 퇴계로 460', '<div style="padding:5px">유락종합사회복지관</div>'],
            [37.6044704692, 127.0959157113, '서울특별시 중랑구 신내로 56', '<div style="padding:5px">유린원광종합사회복지관</div>'],
            [37.5644645178, 126.9502888377, '서울특별시 서대문구 이화여대길 52', '<div style="padding:5px">이대종합사회복지관</div>'],
            [37.5328984063, 127.0752336539, '서울특별시 광진구 자양번영로 35', '<div style="padding:5px">자양종합사회복지관</div>'],
            [37.567951493, 127.0661707285, '서울특별시 동대문구 한천로18길 48', '<div style="padding:5px">장안종합사회복지관</div>'],
            [37.6107047258, 127.0605066641, '서울특별시 성북구 돌곶이로 22길 47', '<div style="padding:5px">장위종합사회복지관</div>'],
            [37.5505366803, 127.0979173773, '서울특별시 광진구 워커힐로 93', '<div style="padding:5px">정립회관</div>'],
            [37.5566865592, 127.0848398814, '서울특별시 광진구 용마산로3길 62', '<div style="padding:5px">중곡종합사회복지관</div>'],
            [37.5594302574, 126.9662595287, '서울특별시 중구 서소문로6길 16', '<div style="padding:5px">중림종합사회복지관</div>'],
            [37.4843616653, 126.9480696715, '서울특별시 관악구 봉천로 41길 33', '<div style="padding:5px">중앙사회복지관</div>'],
            [37.5277283616, 127.113850965, '서울특별시 송파구 강동대로3길 5', '<div style="padding:5px">풍납종합사회복지관</div>'],
            [37.4973316468, 126.8801353962, '서울특별시 구로구 벚꽃로484', '<div style="padding:5px">화원종합사회복지관</div>'],
            [37.5599601325, 126.8655598554, '서울특별시 강서구 양천로61길 101', '<div style="padding:5px">강서구립가양도서관</div>'],
            [37.5624550552, 126.8423747513, '서울특별시 강서구 강서로 62길 48', '<div style="padding:5px">강서구립등빛도서관</div>'],
            [37.5446697303, 126.8351791001, '서울특별시 강서구 강서로 45다길 71', '<div style="padding:5px">강서구립푸른들청소년도서관</div>'],
            [37.534685313, 126.8608014616, '서울특별시 강서구 곰달래로57가길 26', '<div style="padding:5px">강서영어도서관</div>'],
            [37.4675976516, 126.9448709116, '서울특별시 관악구 신림로3길 35', '<div style="padding:5px">관악문화재단_관악중앙도서관</div>'],
            [37.5510729137, 127.1106154952, '서울특별시 광진구 아차산로 78길 90', '<div style="padding:5px">광진정보도서관</div>'],
            [37.4898802688, 126.8865601998, '서울특별시 구로구 구로동로 26길 54', '<div style="padding:5px">구로문화원_구로꿈나무어린이도서관</div>'],
            [37.5022113574, 126.8292614806, '서울특별시 구로구 오리로 1352', '<div style="padding:5px">구로문화원_궁동어린이도서관</div>'],
            [37.5069156006, 126.8456370249, '서울특별시 구로구 고척로27바길 7', '<div style="padding:5px">구로문화원_글마루한옥어린이도서관</div>'],
            [37.4871431613, 126.8901546562, '서울특별시 구로구 디지털로27다길 65', '<div style="padding:5px">구로문화원_꿈마을도서관</div>'],
            [37.4974618736, 126.8865542735, '서울특별시 구로구 구로중앙로27나길 9', '<div style="padding:5px">구로문화원_온누리도서관</div>'],
            [37.4873773789, 126.8813503024, '서울특별시 구로구 구로동로13길 68', '<div style="padding:5px">구로문화원_하늘도서관</div>'],
            [37.6301393577, 126.9199312434, '서울특별시 은평구 통일로 972', '<div style="padding:5px">구립은뜨락도서관</div>'],
            [37.6372315677, 126.9331175534, '서울특별시 은평구 진관2로 111-51', '<div style="padding:5px">구립은평뉴타운도서관</div>'],
            [37.5859660215, 126.9196809278, '서울특별시 은평구 가좌로7길 15', '<div style="padding:5px">구립응암정보도서관</div>'],
            [37.5828094398, 126.9076713303, '서울특별시 은평구 증산로5길 6', '<div style="padding:5px">구립증산정보도서관</div>'],
            [37.498544255, 126.8767538422, '서울특별시 구로구 구일로8길 131', '<div style="padding:5px">그래그래작은도서관</div>'],
            [37.5916963128, 126.9080481593, '서울특별시 은평구 증산로 17길 50', '<div style="padding:5px">내를건너서숲으로도서관</div>'],
            [37.5043187279, 126.8960774463, '서울특별시 영등포구 도신로 27', '<div style="padding:5px">대림정보문화도서관</div>'],
            [37.6097690028, 127.098976905, '서울특별시 중랑구 용마산로 669', '<div style="padding:5px">데시앙책울터작은도서관</div>'],
            [37.6446909352, 127.0437682863, '서울특별시 도봉구 덕릉로315', '<div style="padding:5px">도봉문화정보도서관</div>'],
            [37.6590468187, 127.049507039, '서울특별시 도봉구 노해로69길 151', '<div style="padding:5px">도봉아이나라도서관</div>'],
            [37.516856572, 126.8908945524, '서울특별시 영등포구 문래로20길 49', '<div style="padding:5px">문래정보문화도서관</div>'],
            [37.4840814153, 126.9673507187, '서울특별시 동작구 솔밭로 86', '<div style="padding:5px">사당솔밭도서관</div>'],
            [37.5729542638, 126.9555490252, '서울특별시 서대문구 독립문공원길 80', '<div style="padding:5px">서대문구립이진아기념도서관</div>'],
            [37.60177255, 126.9489543631, '서울특별시 서대문구 홍은중앙로 129', '<div style="padding:5px">서대문구립홍은도담도서관</div>'],
            [37.5663174209, 126.977829174, '서울특별시 중구 세종대로 110', '<div style="padding:5px">서울도서관</div>'],
            [37.5223919742, 127.1029817691, '서울특별시 송파구 오금로 1', '<div style="padding:5px">서울책보고</div>'],
            [37.5333325412, 126.8929388653, '서울특별시 영등포구 선유로 43가길 10-8', '<div style="padding:5px">선유정보문화도서관</div>'],
            [37.5028945715, 127.077705289, '서울특별시 송파구 탄천동로 211', '<div style="padding:5px">소나무언덕잠실본동작은도서관</div>'],
            [37.4808342224, 127.1304779324, '서울특별시 송파구 충민로120', '<div style="padding:5px">송파글마루도서관</div>'],
            [37.5121020708, 127.0824291687, '서울특별시 송파구 올림픽로 105', '<div style="padding:5px">송파어린이도서관</div>'],
            [37.4811656603, 127.1439377597, '서울특별시 송파구 위례광장로 210', '<div style="padding:5px">송파위례도서관</div>'],
            [37.6470421197, 127.0262301859, '서울특별시 도봉구 우이천로 340', '<div style="padding:5px">쌍문채움도서관</div>'],
            [37.5221803249, 126.9199165508, '서울특별시 영등포구 여의대로 24', '<div style="padding:5px">여의샛강마을도서관</div>'],
            [37.5539252695, 126.9676043326, '서울특별시 용산구 청파로93길 27', '<div style="padding:5px">용산구립청파도서관</div>'],
            [37.6095086588, 126.9130882884, '서울특별시 은평구 연서로 13길 29-23', '<div style="padding:5px">은평구립구산동도서관마을</div>'],
            [37.6189785221, 126.9282719247, '서울특별시 은평구 통일로78가길 13-84', '<div style="padding:5px">은평구립도서관</div>'],
            [37.5340977893, 127.0662583596, '서울특별시 광진구 뚝섬로26길 58', '<div style="padding:5px">자양제4동도서관</div>'],
            [37.571244986, 127.0732010399, '서울특별시 동대문구 장한로 26다길 10', '<div style="padding:5px">장안어린이도서관_동대문구청소속</div>'],
            [37.5677792027, 127.0848024301, '서울특별시 광진구 능동로 433', '<div style="padding:5px">중곡문화체육센터도서관</div>'],
            [37.4949831173, 126.8390711719, '서울특별시 구로구 고척로 1길 30', '<div style="padding:5px">흥부네그림책도서관</div>'],
            [37.57222297, 126.8384120248, '서울특별시 강서구 양천로47길 36', '<div style="padding:5px">겸재정선미술관</div>'],
            [37.6406604547, 127.0668655791, '서울특별시 노원구 동일로 1238', '<div style="padding:5px">북서울미술관</div>'],
            [37.5767519879, 126.9378581691, '서울특별시 서대문구 연희로32길 51', '<div style="padding:5px">서대문자연사박물관</div>'],
            [37.5746085138, 126.9556117748, '서울특별시 서대문구 통일로 251', '<div style="padding:5px">서대문형무소역사관</div>'],
            [37.6072253744, 126.9344311966, '서울특별시 은평구 통일로 62길 7', '<div style="padding:5px">서울기록원 </div>'],
            [37.6419941138, 127.0774370647, '서울특별시 노원구 한글 비석로 160', '<div style="padding:5px">서울시립과학관</div>'],
            [37.5641060692, 126.9736993161, '서울특별시 중구 덕수궁길 61', '<div style="padding:5px">서울시립미술관</div>'],
            [37.5722444079, 126.8328428313, '서울특별시 강서구 마곡동로 161', '<div style="padding:5px">서울식물원</div>'],
            [37.5806004145, 127.037586644, '서울특별시 동대문구 약령중앙로 26', '<div style="padding:5px">서울약령시한의약박물관</div>'],
            [37.5704968494, 126.9710752204, '서울특별시 종로구 새문안로 55', '<div style="padding:5px">서울역사박물관</div>'],
            [37.5684664512, 126.9893003133, '서울특별시 종로구 청계천로 105', '<div style="padding:5px">아름다운청년_전태일기념관</div>'],
            [37.6403336262, 126.9380081719, '서울특별시 은평구 연서로50길 8', '<div style="padding:5px">은평역사한옥박물관</div>'],
            [37.5154287227, 127.1208007069, '서울특별시 송파구 위례성대로 71', '<div style="padding:5px">한성백제박물관</div>'],
            [37.5678724473, 126.8510312438, '서울특별시 강서구 허준로 87', '<div style="padding:5px">허준박물관</div>'],
            [37.4703086452, 126.9390659889, '서울특별시 관악구 신림로 91', '<div style="padding:5px">관악청년문화공간_신림동쓰리룸</div>'],
            [37.5568085815, 126.9715661479, '서울특별시 중구 통일로 13', '<div style="padding:5px">다시서기종합지원센터</div>'],
            [37.4781993742, 126.9070366019, '서울특별시 금천구 남부순환로128길 42', '<div style="padding:5px">모두의학교</div>'],
            [37.5083329381, 126.9320716198, '서울특별시 동작구 등용로 79-1', '<div style="padding:5px">무중력지대_대방동</div>'],
            [37.524596999, 126.8773101156, '서울특별시 양천구 오목로 359', '<div style="padding:5px">무중력지대_양천</div>'],
            [37.6558908274, 127.0135631523, '서울특별시 도봉구 삼양로 592, 2층', '<div style="padding:5px">삼각산시민청</div>'],
            [37.5047478698, 126.8974096965, '서울특별시 영등포구 도신로 40', '<div style="padding:5px">서남권글로벌센터</div>'],
            [37.5703466887, 126.8950314201, '서울특별시 마포구 증산로 87', '<div style="padding:5px">서부공원녹지사업소_문화비축기지</div>'],
            [37.5680142223, 127.0109091409, '서울특별시 중구 을지로 281', '<div style="padding:5px">서울디자인재단DDP</div>'],
            [37.5282200532, 126.8321456879, '서울특별시 양천구 남부순환로 64길 2', '<div style="padding:5px">서울문화재단_서서울예술교육센터</div>'],
            [37.5922223828, 127.0371075284, '서울특별시 성북구 회기로 3길 17', '<div style="padding:5px">서울문화재단_서울예술치유허브_종료예정</div>'],
            [37.5663174209, 126.977829174, '서울특별시 중구 세종대로 110', '<div style="padding:5px">서울문화재단_시민청</div>'],
            [37.5520117024, 127.0787723914, '서울특별시 광진구 능동로 216', '<div style="padding:5px">서울상상나라</div>'],
            [37.5586850612, 127.057851176, '서울특별시 성동구 자동차시장길 49', '<div style="padding:5px">서울새활용플라자</div>'],
            [37.5825775765, 127.0599881269, '서울특별시 동대문구 서울시립대로 163', '<div style="padding:5px">서울시립대학교</div>'],
            [37.5716126639, 127.0360479569, '서울특별시 성동구 청계천로 540', '<div style="padding:5px">서울시설공단</div>'],
            [37.5586406607, 127.0066775131, '서울특별시 중구 동호로 241', '<div style="padding:5px">서울시설공단_장충체육관</div>'],
            [37.5671565387, 126.9870522997, '서울특별시 중구 삼일대로 363, 1층', '<div style="padding:5px">서울시청년일자리센터</div>'],
            [37.4941313928, 127.0787831411, '서울특별시 강남구 개포로 621', '<div style="padding:5px">서울주택도시공사</div>'],
            [37.4799664298, 126.8826362002, '서울특별시 금천구 가산디지털1로 168, A동 612호', '<div style="padding:5px">서울청년센터_금천</div>'],
            [37.610713147, 126.9284564312, '서울특별시 은평구 통일로 67길 9, A동 2층', '<div style="padding:5px">서울청년센터_은평_오랑</div>'],
            [37.5244926351, 126.9014229795, '서울특별시 영등포구 영신로 183', '<div style="padding:5px">서울하우징랩</div>'],
            [37.6094070491, 126.9349538787, '서울특별시 은평구 통일로 684', '<div style="padding:5px">서울혁신파크</div>'],
            [37.6094070491, 126.9349538787, '서울특별시 은평구 통일로 684', '<div style="padding:5px">서울혁신파크_청년청</div>'],
            [37.5330498271, 127.1334133953, '서울특별시 강동구 성안로 108', '<div style="padding:5px">엔젤공방허브센터_강동구청소속_여성</div>'],
            [37.5260087284, 126.9001092559, '서울특별시 영등포구 국회대로 596', '<div style="padding:5px">영등포문화재단</div>'],
            [37.5659409687, 127.0147908897, '서울특별시 중구 퇴계로 387', '<div style="padding:5px">중구문화재단_충무아트센터</div>'],
            [37.6144552389, 127.0842168326, '서울특별시 중랑구 숙선옹주로 66', '<div style="padding:5px">중랑구시설관리공단_묵동다목적체육관</div>'],
            [37.6112527783, 127.089463628, '서울특별시 중랑구 신내로21길 115-14', '<div style="padding:5px">중랑구시설관리공단_신내다목적체육관</div>'],
            [37.5611324892, 126.9004560284, '서울특별시 마포구 방울내로5길 42', '<div style="padding:5px">청년교류공간</div>']
            ];
        
            for (var i = 0; i < 데이터.length; i++ ) {
            var marker = new kakao.maps.Marker({
            position: new kakao.maps.LatLng(데이터[i][0], 데이터[i][1]),
            map: map
            });
        
            iwPosition = new kakao.maps.LatLng(데이터[i][0], 데이터[i][1]),
            iwRemoveable = true; 
        
            var infowindow = new kakao.maps.InfoWindow({
            position : iwPosition, 
            content : 데이터[i][3],
            removable : iwRemoveable
            });
            kakao.maps.event.addListener(marker, 'mouseover', makeOverListener(map, marker, infowindow));
            kakao.maps.event.addListener(marker, 'mouseout', makeOutListener(infowindow));
        }
        
        function makeOverListener(map, marker, infowindow) {
            return function() {
                infowindow.open(map, marker);
            };
        }
        
        function makeOutListener(infowindow) {
            return function() {
                infowindow.close();
            };
        }
        </script>
            </div>
        </center>
        <br><br>
    </div>
    </main>`;

    var html = template.HTML(title, head, body, author.statusUI(request, response));
    response.send(html);
});

module.exports = router;